src/Tasks/ЗадачаИсполнителя/ЗадачаИсполнителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачаИсполнителя</name>
  <addressing>InformationRegister.ИсполнителиЗадач</addressing>
  <attributes>
    <name>Автор</name>
    <comment>Автор бизнес-процесса, который сформировал задачу</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <comment>Важность задачи - для приоритезации исполнителем своих задач</comment>
    <type>
      <types>EnumRef.ВариантыВажностиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <comment>Дата и время фактического выполнения задачи</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <comment>Дата начала выполнения задачи - для приоритезации исполнителем своих задач</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияКИсполнению</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание постановки задачи для исполнителя</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключенаИзПроцесса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПредмет</name>
    <comment>Предмет задачи</comment>
    <type>
      <types>CatalogRef.ТемыОбсуждений</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.СообщенияОбсуждений</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметСтрокой</name>
    <comment>Строковое представление предмета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПринятаКИсполнению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроектнаяЗадача</name>
    <type>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <comment>Описание результата выполнения</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеБизнесПроцесса</name>
    <type>
      <types>EnumRef.СостоянияБизнесПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Плановый срок исполнения задачи</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущийДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущийИсполнитель</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущийОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийИсполнитель</name>
    <type>
      <types>CatalogRef.ПолныеРоли</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Предметы</name>
    <attributes>
      <name>РольПредмета</name>
      <type>
        <types>EnumRef.РолиПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредмета</name>
      <type>
        <types>CatalogRef.ИменаПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>Предмет</name>
      <comment>Предмет задачи</comment>
      <type>
        <types>CatalogRef.УведомленияПрограммы</types>
        <types>CatalogRef.ТемыОбсуждений</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Проекты</types>
        <types>CatalogRef.ПротоколыМероприятий</types>
        <types>DocumentRef.ВходящееПисьмо</types>
        <types>DocumentRef.ИсходящееПисьмо</types>
        <types>CatalogRef.Файлы</types>
        <types>CatalogRef.ВходящиеДокументы</types>
        <types>DocumentRef.Бронь</types>
        <types>CatalogRef.ВнутренниеДокументы</types>
        <types>CatalogRef.СообщенияОбсуждений</types>
        <types>CatalogRef.ИсходящиеДокументы</types>
        <types>CatalogRef.Мероприятия</types>
        <types>CatalogRef.ПроектныеЗадачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступноУдаление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязательноеЗаполнение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <addressingAttributes>
    <name>УдалитьДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>УдалитьОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>УдалитьРольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.ПолныеРоли</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

src/InformationRegisters/ИсполнителиРолейИДелегаты/ИсполнителиРолейИДелегаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсполнителиРолейИДелегаты</name>
  <dimensions>
    <name>ИсполнительДелегат</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РольПользователь</name>
    <type>
      <types>CatalogRef.ПолныеРоли</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаДелегирования</name>
    <comment>Настройку делегирования, по которой была сделана запись в регистре.</comment>
    <type>
      <types>CatalogRef.ДелегированиеПрав</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьРольПользователь</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбластиДелегирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗадачиДляВыполнения/ЗадачиДляВыполнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиДляВыполнения</name>
  <resources>
    <name>КоличествоПопытокОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МоментВремени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Параметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтменыВыполнения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеВыполнения</name>
    <type>
      <types>EnumRef.СостоянияЗадачДляВыполнения</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ВидыВнутреннихДокументов/ВидыВнутреннихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыВнутреннихДокументов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АвтоматическиВестиСоставУчастниковРабочейГруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПодписания</name>
    <type>
      <types>EnumRef.ВариантыПодписания</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантУказанияОтменяющегоДокумента</name>
    <type>
      <types>EnumRef.ВариантыУказанияОтменяющегоДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоАдресатам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоКонтрагентам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоНоменклатуреДел</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСтатьямДДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетСторон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетТоваровИУслуг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключенУчетПоНоменклатуреДел</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьСозданиеДокументовНеПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПодписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСрокИсполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУтверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЭтапыОбработкиДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьНаличиеОригинала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьУникальностьДокументаВРамкахПроекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимаПечатьШтрихкода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязателенФайлОригинала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнениеРабочихГруппДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеУказаниеОтветственного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноУказаниеПроекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписыватьРезолюцииЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНумератор</name>
    <type>
      <types>CatalogRef.Нумераторы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСпособНумерации</name>
    <type>
      <types>EnumRef.СпособыНумерации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьМестоХранения</name>
    <type>
      <types>EnumRef.ВариантыИспользованияПолейХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНедействующиеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьОтветственногоЗаХранение</name>
    <type>
      <types>EnumRef.ВариантыИспользованияПолейХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСрокДействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСуммуДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаДокумента</name>
    <type>
      <types>EnumRef.ВариантыФормДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяДоговором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяЗаявкойНаОплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяКомплектомДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НаименованияСторон</name>
    <attributes>
      <name>НаименованиеСтороны</name>
      <type>
        <types>CatalogRef.НаименованияСторон</types>
      </type>
    </attributes>
    <attributes>
      <name>ДопустимыОрганизации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДопустимыКонтрагенты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДопустимыПользователи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Tasks/ЗадачаИсполнителя/Forms/МК_ВыборВидаПредметаЗадачи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда 
		Строки1 = ЗадачиМнеПредметы.ПолучитьЭлементы();
		Для Каждого Строка1 Из Строки1 цикл
			Строки2 = Строка1.ПолучитьЭлементы();
			Для Каждого Строка2 Из Строки2 Цикл
				Если Строка2.ВидПредмета = Параметры.ТекущаяСтрока Тогда 
					Элементы.Дерево.ТекущаяСтрока = Строка2.ПолучитьИдентификатор();
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДерево

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ВидПредмета) Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДерево()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДеревоПредметы = РеквизитФормыВЗначение("ЗадачиМнеПредметы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИсполнителиРолейИДелегаты.РольПользователь КАК Исполнитель
		|ПОМЕСТИТЬ ИсполнителиЗадач
		|ИЗ
		|	РегистрСведений.ИсполнителиРолейИДелегаты КАК ИсполнителиРолейИДелегаты
		|ГДЕ
		|	ИсполнителиРолейИДелегаты.ИсполнительДелегат = &ТекущийПользователь
		|	И ИсполнителиРолейИДелегаты.ИмяОбластиДелегирования В ("""", ""ПроцессыИЗадачи"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ПредметыЗадач.Предмет, НЕОПРЕДЕЛЕНО) КАК Предмет
		|ПОМЕСТИТЬ ВсеПредметы
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК Задачи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсполнителиЗадач КАК ИсполнителиЗадач
		|		ПО Задачи.ТекущийИсполнитель = ИсполнителиЗадач.Исполнитель
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачаИсполнителя.Предметы КАК ПредметыЗадач
		|		ПО Задачи.Ссылка = ПредметыЗадач.Ссылка
		|			И (ПредметыЗадач.РольПредмета = ЗНАЧЕНИЕ(Перечисление.РолиПредметов.Основной))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиДляВыполнения КАК ЗадачиДляВыполнения
		|		ПО Задачи.Ссылка = ЗадачиДляВыполнения.Задача
		|ГДЕ
		|	Задачи.СостояниеБизнесПроцесса = ЗНАЧЕНИЕ(Перечисление.СостоянияБизнесПроцессов.Активен)
		|	И ЕСТЬNULL(ЗадачиДляВыполнения.СостояниеВыполнения, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗадачДляВыполнения.ГотоваКВыполнению)
		|	И Задачи.ПометкаУдаления = ЛОЖЬ
		|	И Задачи.ИсключенаИзПроцесса = ЛОЖЬ
		|	И &ДопУсловия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ВидПредмета КАК ВидПредмета,
		|	ВложенныйЗапрос.ПредставлениеВидаПредмета КАК ПредставлениеВидаПредмета,
		|	ВложенныйЗапрос.УчитыватьСуммуДокумента КАК УчитыватьСуммуДокумента,
		|	ВложенныйЗапрос.УчитыватьСрокДействия КАК УчитыватьСрокДействия,
		|	ВложенныйЗапрос.ВестиУчетПоКонтрагентам КАК ВестиУчетПоКонтрагентам,
		|	ВложенныйЗапрос.ВестиУчетПоОрганизациям КАК ВестиУчетПоОрганизациям,
		|	ВложенныйЗапрос.ИспользоватьСрокИсполнения КАК ИспользоватьСрокИсполнения,
		|	ВложенныйЗапрос.ЯвляетсяОбращениемОтГраждан КАК ЯвляетсяОбращениемОтГраждан
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА НЕ ВидыВнутреннихДокументов.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыВнутреннихДокументов.Ссылка
		|			КОГДА НЕ ВидыВходящихДокументов.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыВходящихДокументов.Ссылка
		|			КОГДА НЕ ВидыИсходящихДокументов.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыИсходящихДокументов.Ссылка
		|			КОГДА НЕ ВидыМероприятий.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыМероприятий.Ссылка
		|			КОГДА НЕ ВидыПроектов.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыПроектов.Ссылка
		|			КОГДА ВсеПредметы.Предмет = НЕОПРЕДЕЛЕНО
		|				ТОГДА &БезПредметаСтрока
		|			ИНАЧЕ ТИПЗНАЧЕНИЯ(ВсеПредметы.Предмет)
		|		КОНЕЦ КАК ВидПредмета,
		|		ВЫБОР
		|			КОГДА НЕ ВидыВнутреннихДокументов.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыВнутреннихДокументов.Представление
		|			КОГДА НЕ ВидыВходящихДокументов.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыВходящихДокументов.Представление
		|			КОГДА НЕ ВидыИсходящихДокументов.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыИсходящихДокументов.Представление
		|			КОГДА НЕ ВидыМероприятий.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыМероприятий.Представление
		|			КОГДА НЕ ВидыПроектов.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыПроектов.Представление
		|			КОГДА ВсеПредметы.Предмет = НЕОПРЕДЕЛЕНО
		|				ТОГДА &БезПредметаСтрока
		|			ИНАЧЕ """"
		|		КОНЕЦ КАК ПредставлениеВидаПредмета,
		|		ВЫБОР
		|			КОГДА НЕ ВидыВнутреннихДокументов.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыВнутреннихДокументов.УчитыватьСуммуДокумента
		|			КОГДА НЕ ВидыВходящихДокументов.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыВходящихДокументов.УчитыватьСуммуДокумента
		|			КОГДА НЕ ВидыИсходящихДокументов.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыИсходящихДокументов.УчитыватьСуммуДокумента
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ КАК УчитыватьСуммуДокумента,
		|		ВЫБОР
		|			КОГДА НЕ ВидыВнутреннихДокументов.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыВнутреннихДокументов.УчитыватьСрокДействия
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ КАК УчитыватьСрокДействия,
		|		ВЫБОР
		|			КОГДА НЕ ВидыВнутреннихДокументов.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыВнутреннихДокументов.ВестиУчетПоКонтрагентам
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ КАК ВестиУчетПоКонтрагентам,
		|		ВЫБОР
		|			КОГДА НЕ ВидыВнутреннихДокументов.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыВнутреннихДокументов.ВестиУчетПоОрганизациям
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ КАК ВестиУчетПоОрганизациям,
		|		ВЫБОР
		|			КОГДА НЕ ВидыВходящихДокументов.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыВходящихДокументов.ИспользоватьСрокИсполнения
		|			КОГДА НЕ ВидыИсходящихДокументов.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыИсходящихДокументов.ИспользоватьСрокИсполнения
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ КАК ИспользоватьСрокИсполнения,
		|		ВЫБОР
		|			КОГДА НЕ ВидыВходящихДокументов.Ссылка ЕСТЬ NULL
		|				ТОГДА ВидыВходящихДокументов.ЯвляетсяОбращениемОтГраждан
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ КАК ЯвляетсяОбращениемОтГраждан
		|	ИЗ
		|		ВсеПредметы КАК ВсеПредметы
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыВнутреннихДокументов КАК ВидыВнутреннихДокументов
		|			ПО (ВЫРАЗИТЬ(ВсеПредметы.Предмет КАК Справочник.ВнутренниеДокументы).ВидДокумента = ВидыВнутреннихДокументов.Ссылка)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыВходящихДокументов КАК ВидыВходящихДокументов
		|			ПО (ВЫРАЗИТЬ(ВсеПредметы.Предмет КАК Справочник.ВходящиеДокументы).ВидДокумента = ВидыВходящихДокументов.Ссылка)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыИсходящихДокументов КАК ВидыИсходящихДокументов
		|			ПО (ВЫРАЗИТЬ(ВсеПредметы.Предмет КАК Справочник.ИсходящиеДокументы).ВидДокумента = ВидыИсходящихДокументов.Ссылка)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыМероприятий КАК ВидыМероприятий
		|			ПО (ВЫРАЗИТЬ(ВсеПредметы.Предмет КАК Справочник.Мероприятия).ВидМероприятия = ВидыМероприятий.Ссылка)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыПроектов КАК ВидыПроектов
		|			ПО (ВЫРАЗИТЬ(ВсеПредметы.Предмет КАК Справочник.Проекты).ВидПроекта = ВидыПроектов.Ссылка)) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.ВидПредмета,
		|	ВложенныйЗапрос.ПредставлениеВидаПредмета,
		|	ВложенныйЗапрос.УчитыватьСуммуДокумента,
		|	ВложенныйЗапрос.УчитыватьСрокДействия,
		|	ВложенныйЗапрос.ВестиУчетПоКонтрагентам,
		|	ВложенныйЗапрос.ВестиУчетПоОрганизациям,
		|	ВложенныйЗапрос.ИспользоватьСрокИсполнения,
		|	ВложенныйЗапрос.ЯвляетсяОбращениемОтГраждан";
	
	ДопУсловия = "";
	Если Не Параметры.ЗадачиМнеПоказыватьВыполненные Тогда
		ДопУсловия = ДопУсловия + Символы.ПС + "И НЕ Задачи.Выполнена";
	КонецЕсли;
	Если Параметры.КлючОтбора = "НеПринятые" Тогда
		ДопУсловия = ДопУсловия + Символы.ПС + "И НЕ Задачи.ПринятаКИсполнению";
	ИначеЕсли Параметры.КлючОтбора = "Просроченные" Тогда
		ДопУсловия = ДопУсловия + Символы.ПС +
			"И Задачи.СрокИсполнения < &ДатаДляОтображенияПросроченных
			|		И Задачи.СрокИсполнения > ДАТАВРЕМЯ(1, 1, 1)";
		Запрос.УстановитьПараметр("ДатаДляОтображенияПросроченных", ТекущаяДатаСеанса());
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ДопУсловия", ДопУсловия);
	
	Запрос.УстановитьПараметр("БезПредметаСтрока", Параметры.СтрокаГруппировкиБезПредмета);
	Запрос.УстановитьПараметр("ТекущийПользователь", Параметры.ТекущийПользователь);
	
	СтрокиВидовПредметов = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	
	КэшВидовПредметов.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		ЭлементыКОбработке = Новый Массив;
		ЭлементыКОбработке.Добавить(Выборка.ВидПредмета);
		
		ТипВидаПредмета = ТипЗнч(Выборка.ВидПредмета);
		Если ТипВидаПредмета = Тип("СправочникСсылка.ВидыВнутреннихДокументов")
			Или ТипВидаПредмета = Тип("СправочникСсылка.ВидыВходящихДокументов")
			Или ТипВидаПредмета = Тип("СправочникСсылка.ВидыИсходящихДокументов") Тогда
			ЭлементыКОбработке.Вставить(0, Параметры.СтрокаГруппировкиДокументы);
		ИначеЕсли ТипВидаПредмета <> Тип("Строка") И ТипВидаПредмета <> Тип("Тип") Тогда
			// Вид мероприятия, проекта.
			ЭлементыКОбработке.Вставить(0, ТипЗнч(Выборка.ВидПредмета));
		КонецЕсли;
		
		СтрокаРодителя = ДеревоПредметы;
		Для Каждого Эл Из ЭлементыКОбработке Цикл 
			
			Стр = СтрокиВидовПредметов[Эл];
			Если Стр = Неопределено Тогда
				Стр = СтрокаРодителя.Строки.Добавить();
				СтрокиВидовПредметов[Эл] = Стр;
				Стр.ВидПредмета = Эл;
				Если Эл = Выборка.ВидПредмета И ЗначениеЗаполнено(Выборка.ПредставлениеВидаПредмета) Тогда
					Стр.Представление = Выборка.ПредставлениеВидаПредмета;
				ИначеЕсли ТипЗнч(Эл) = Тип("Тип") Тогда
					МетаданныеПоТипу = Метаданные.НайтиПоТипу(Эл);
					Если МетаданныеПоТипу <> Неопределено Тогда
						Стр.ВидПредмета = МетаданныеПоТипу.ПолноеИмя();
						Если МетаданныеПоТипу = Метаданные.Справочники.ВидыВнутреннихДокументов Тогда
							Стр.Представление = НСтр("ru = 'Документы внутренние'");
						ИначеЕсли МетаданныеПоТипу = Метаданные.Справочники.ВидыВходящихДокументов Тогда
							Стр.Представление = НСтр("ru = 'Документы входящие'");
						ИначеЕсли МетаданныеПоТипу = Метаданные.Справочники.ВидыИсходящихДокументов Тогда
							Стр.Представление = НСтр("ru = 'Документы исходящие'");
						ИначеЕсли МетаданныеПоТипу = Метаданные.Справочники.ВидыМероприятий Тогда
							Стр.Представление = НСтр("ru = 'Мероприятия'");
						ИначеЕсли МетаданныеПоТипу = Метаданные.Справочники.ВидыПроектов Тогда
							Стр.Представление = НСтр("ru = 'Проекты'");
						Иначе
							Стр.Представление = ?(ЗначениеЗаполнено(МетаданныеПоТипу.ПредставлениеСписка),
								МетаданныеПоТипу.ПредставлениеСписка, МетаданныеПоТипу.Синоним);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Стр.Представление) Тогда
					Стр.Представление = Строка(Эл);
				КонецЕсли;
				
				// Добавление в кэш.
				СтрКэша = КэшВидовПредметов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрКэша, Выборка);
				СтрКэша.УникальныйИдентификатор = Стр.ВидПредмета;
				СтрКэша.ВидПредмета = Стр.ВидПредмета;
				
				Если ЗначениеЗаполнено(Стр.ВидПредмета) Тогда
					
					Если ОбщегоНазначения.ЗначениеСсылочногоТипа(Стр.ВидПредмета) Тогда
						СтрКэша.УникальныйИдентификатор = Стр.ВидПредмета.УникальныйИдентификатор();
					КонецЕсли;	
					
				КонецЕсли;	
				
			КонецЕсли;
			//Стр.Количество = Стр.Количество + Выборка.Количество;
			СтрокаРодителя = Стр;
			Если Эл <> Выборка.ВидПредмета И ТипЗнч(Эл) = ТипЗнч(Выборка.ВидПредмета) Тогда
				Стр.ЭтоГруппаВидов = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ДеревоПредметы.Строки.Сортировать("Представление Возр", Истина);
	
	// Заполнение подчиненных видов для групп.
	ТипыПодчиненныхВидов = Новый Соответствие;
	ТипыПодчиненныхВидов[Тип("СправочникСсылка.ВидыВнутреннихДокументов")] = Истина;
	ТипыПодчиненныхВидов[Тип("СправочникСсылка.ВидыВходящихДокументов")] = Истина;
	ТипыПодчиненныхВидов[Тип("СправочникСсылка.ВидыИсходящихДокументов")] = Истина;
	
	ВсеСтрокиКОработке = Новый Массив;
	СтрокиПодчиненныхВидов = Новый Массив;
	Для Каждого СтрДерева Из ДеревоПредметы.Строки Цикл
		ВсеСтрокиКОработке.Добавить(СтрДерева);
	КонецЦикла;
	Пока ВсеСтрокиКОработке.Количество() > 0 Цикл
		ТекущаяСтрока = ВсеСтрокиКОработке[0];
		Для Каждого СтрДерева Из ТекущаяСтрока.Строки Цикл
			ВсеСтрокиКОработке.Добавить(СтрДерева);
		КонецЦикла;
		Если Не ТекущаяСтрока.ЭтоГруппаВидов
			И ТипыПодчиненныхВидов[ТипЗнч(ТекущаяСтрока.ВидПредмета)] <> Неопределено Тогда
			Родитель = ТекущаяСтрока.Родитель;
			Пока Родитель <> Неопределено И Родитель.ЭтоГруппаВидов Цикл
				Если Родитель.ПодчиненныеВиды = Неопределено Тогда
					Родитель.ПодчиненныеВиды = Новый Массив;
				КонецЕсли;
				Родитель.ПодчиненныеВиды.Добавить(ТекущаяСтрока.ВидПредмета);
				Родитель = Родитель.Родитель;
			КонецЦикла;
		КонецЕсли;
		ВсеСтрокиКОработке.Удалить(0);
	КонецЦикла;
	
	// Поиск дублей, уточнение представления.
	НайденныеСтроки = ДеревоПредметы.Строки.НайтиСтроки(
		Новый Структура("ВидПредмета", Параметры.СтрокаГруппировкиДокументы));
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		СтрокаДокументы = НайденныеСтроки[0];
		СтрокиПоПредставлениям = Новый Соответствие;
		
		Для Каждого Стр Из СтрокаДокументы.Строки Цикл
			МассивСтрокСПредставлением = СтрокиПоПредставлениям[Стр.Представление];
			Если МассивСтрокСПредставлением = Неопределено Тогда
				СтрокиПоПредставлениям[Стр.Представление] = Новый Массив;
				МассивСтрокСПредставлением = СтрокиПоПредставлениям[Стр.Представление];
			КонецЕсли;
			МассивСтрокСПредставлением.Добавить(Стр);
		КонецЦикла;
		
		Для Каждого КлючИЗначение Из СтрокиПоПредставлениям Цикл
			
			СтрокиСОдинаковымНаименованием = КлючИЗначение.Значение;
			Если СтрокиСОдинаковымНаименованием.Количество() < 2 Тогда
				Продолжить;
			КонецЕсли;
			
			УточненияПредставленийСтрок = Новый Соответствие;
			ТипыВидовПредметов = Новый Соответствие;
			Для Каждого Стр Из СтрокиСОдинаковымНаименованием Цикл
				ТипВидаПредмета = ТипЗнч(Стр.ВидПредмета);
				ПредставлениеТипа = Строка(ТипВидаПредмета);
				Если ТипВидаПредмета = Тип("СправочникСсылка.ВидыВнутреннихДокументов") Тогда
					ПредставлениеТипа = НСтр("ru = 'внутр.'");
				ИначеЕсли ТипВидаПредмета = Тип("СправочникСсылка.ВидыВходящихДокументов") Тогда
					ПредставлениеТипа = НСтр("ru = 'вх.'");
				ИначеЕсли ТипВидаПредмета = Тип("СправочникСсылка.ВидыИсходящихДокументов") Тогда
					ПредставлениеТипа = НСтр("ru = 'исх.'");
				КонецЕсли;
				ТипыВидовПредметов[ТипВидаПредмета] = ПредставлениеТипа;
			КонецЦикла;
			Если ТипыВидовПредметов.Количество() > 1 Тогда
				// Имеет смысл уточнение по типу.
				Для Каждого Стр Из СтрокиСОдинаковымНаименованием Цикл
					ПредставлениеТипа = ТипыВидовПредметов[ТипЗнч(Стр.ВидПредмета)];
					УточненияПредставленийСтрок[Стр] = ПредставлениеТипа;
				КонецЦикла;
			КонецЕсли;
			
			Если ТипыВидовПредметов.Количество() < СтрокиСОдинаковымНаименованием.Количество() Тогда
				РодителиВидовПредметов = Новый Соответствие;
				Для Каждого Стр Из СтрокиСОдинаковымНаименованием Цикл
					Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ВидПредмета, "Родитель");
					РодителиВидовПредметов[Родитель] = Истина;
				КонецЦикла;
				Если РодителиВидовПредметов.Количество() > 1 Тогда
					// Имеет смысл уточнение по родителю.
					Для Каждого Стр Из СтрокиСОдинаковымНаименованием Цикл
						ПолныйПутьРодителя = "";
						ВсеРодители = ОбщегоНазначенияДокументооборот.ВсеРодителиЭлемента(Стр.ВидПредмета);
						Если ВсеРодители.Количество() = 0 Тогда
							Продолжить;
						КонецЕсли;
						Для Каждого ТекущийРодитель Из ВсеРодители Цикл
							ПолныйПутьРодителя = СокрЛП(Строка(ТекущийРодитель)) +
								?(ПолныйПутьРодителя = "", "", "\") + ПолныйПутьРодителя;
						КонецЦикла;
						Уточнение = УточненияПредставленийСтрок[Стр];
						Если Уточнение = Неопределено Тогда
							Уточнение = ПолныйПутьРодителя;
						Иначе
							Уточнение = Уточнение + ", " + ПолныйПутьРодителя;
						КонецЕсли;
						УточненияПредставленийСтрок[Стр] = Уточнение;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
			Для Каждого СтрокаИУточнение Из УточненияПредставленийСтрок Цикл
				Стр = СтрокаИУточнение.Ключ;
				Уточнение = СтрокаИУточнение.Значение;
				Если Уточнение <> Неопределено Тогда
					Стр.Представление = СтрШаблон ("%1 (%2)", Стр.Представление, Уточнение);
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДеревоПредметы, "ЗадачиМнеПредметы");
	
КонецПроцедуры

#КонецОбласти
